## Pandas Data.Frames

In [31]:
import numpy as np
import pandas as pd
pd.set_option('display.max_columns', None)

Now, lets make a data frame with first making a list for each variable.

In [2]:
cities=["Delhi","Mumbai","Kolkata","Chennai"]
code = [11,22,33,44]

mydata=list(zip(cities,code))

zip combines corresponding elements of an iterable into 
tuples

In [3]:
mydata

[('Delhi', 11), ('Mumbai', 22), ('Kolkata', 33), ('Chennai', 44)]

now lets convert this to a pandas data frame which comes with lot of useful and intuitive properties which makes our job easy when working with dataframes in general. If you have worked with R before, then you'd notice that pandas dataframes works very similar to R's data frames.

In [8]:
df = pd.DataFrame(data=mydata,columns=["cities","codes"])
df

    cities  codes
0    Delhi     11
1   Mumbai     22
2  Kolkata     33
3  Chennai     44

In [7]:
type(df)

pandas.core.frame.DataFrame

In [140]:
df = pd.DataFrame({"cities":cities,"code":code})
df

    cities  code
0    Delhi    11
1   Mumbai    22
2  Kolkata    33
3  Chennai    44

to write a data frame to csv file , you can use function to_csv. In the function you need to set option index=False in order to avoid writing rownumbers to csv file and header=True , in order to write variables names in the first row of the csv file.

if you simply provide the file name, it will be written to where your .ipynb/.py file is. In case you want to write the file to a specific location then you'd need to mention the file name with complete path.

In [16]:
df.to_csv("data/mydata2.csv",index=False,header=False)
#df.to_csv("data/mydata.csv")

You can use function ExcelWriter to creater a writer object for an excel file. and then use function to_excel with data frame to write data to excel file. Here is an example

In [17]:
writer=pd.ExcelWriter("mydata.xlsx")

df.to_excel(writer,"Sheet1",index=False)
df.to_excel(writer,"Sheet2")

In [73]:
file='../data/loans data.csv'
ld=pd.read_csv(file)

using function `head` you can lok at first few observations in the data which gives an idea about whether data was imported properly to python or not.

In [22]:
ld.head(10)

,ID,Amount.Requested,Amount.Funded.By.Investors,Interest.Rate,Loan.Length,Loan.Purpose,Debt.To.Income.Ratio,State,Home.Ownership,Monthly.Income,FICO.Range,Open.CREDIT.Lines,Revolving.CREDIT.Balance,Inquiries.in.the.Last.6.Months,Employment.Length
0,81174.0,20000,20000,8.90%,36 months,debt_consolidation,14.90%,SC,MORTGAGE,6541.67,735-739,14,14272,2.0,< 1 year
1,99592.0,19200,19200,12.12%,36 months,debt_consolidation,28.36%,TX,MORTGAGE,4583.33,715-719,12,11140,1.0,2 years
2,80059.0,35000,35000,21.98%,60 months,debt_consolidation,23.81%,CA,MORTGAGE,11500.00,690-694,14,21977,1.0,2 years
3,15825.0,10000,9975,9.99%,36 months,debt_consolidation,14.30%,KS,MORTGAGE,3833.33,695-699,10,9346,0.0,5 years
4,33182.0,12000,12000,11.71%,36 months,credit_card,18.78%,NJ,RENT,3195.00,695-699,11,14469,0.0,9 years
5,62403.0,6000,6000,15.31%,36 months,other,20.05%,CT,OWN,4891.67,670-674,17,10391,2.0,3 years
6,48808.0,10000,10000,7.90%,36 months,debt_consolidation,26.09%,MA,RENT,2916.67,720-724,10,15957,0.0,10+ years
7,22090.0,33500,33450,17.14%,60 months,credit_card,14.70%,LA,MORTGAGE,13863.42,705-709,12,27874,0.0,10+ years
8,76404.0,14675,14675,14.33%,36 months,credit_card,26.92%,CA,RENT,3150.00,685-689,9,7246,1.0,8 years
9,15867.0,.,7000,6.91%,36 months,credit_card,7.10%,CA,RENT,5000.00,715-719,8,7612,0.0,3 years

to get column names we can look attribute column of the data

In [24]:
len(ld.columns)

15

In [23]:
ld.columns

Index(['ID', 'Amount.Requested', 'Amount.Funded.By.Investors', 'Interest.Rate',
       'Loan.Length', 'Loan.Purpose', 'Debt.To.Income.Ratio', 'State',
       'Home.Ownership', 'Monthly.Income', 'FICO.Range', 'Open.CREDIT.Lines',
       'Revolving.CREDIT.Balance', 'Inquiries.in.the.Last.6.Months',
       'Employment.Length'],
      dtype='object')

to see type of these columns we can use attribute dtypes

In [25]:
ld.dtypes

ID                                float64
Amount.Requested                   object
Amount.Funded.By.Investors         object
Interest.Rate                      object
Loan.Length                        object
Loan.Purpose                       object
Debt.To.Income.Ratio               object
State                              object
Home.Ownership                     object
Monthly.Income                    float64
FICO.Range                         object
Open.CREDIT.Lines                  object
Revolving.CREDIT.Balance           object
Inquiries.in.the.Last.6.Months    float64
Employment.Length                  object
dtype: object

flost64 here correponds to numeric values and object corresponds to categorical columns

to know how many rows and columns are their in the data we can use attribute shape

In [26]:
ld.shape

(2500, 15)

this tells us that the data has 2500 rows/observations and 15 columns in it

## Indexing/ Subsetting

 - iloc
 - loc
 - ix <br>
 
`loc` gets rows (or columns) with particular labels from the index. `iloc` gets rows (or columns) at particular positions in the index (so it only takes integers). `ix` usually tries to behave like `loc` but falls back to behaving like `iloc` if a label is not present in the index.

now lets subset this data on the basis of row and column numbers , keep in mind that count start with 0 for both

In [27]:
ld1=ld.iloc[3:7,1:5]
ld1

  Amount.Requested Amount.Funded.By.Investors Interest.Rate Loan.Length
3            10000                       9975         9.99%   36 months
4            12000                      12000        11.71%   36 months
5             6000                       6000        15.31%   36 months
6            10000                      10000         7.90%   36 months

iloc here correponds to subsetting by position , to understand this better lets try to further subset this data

In [28]:
ld1.iloc[2:4,1:3]

  Amount.Funded.By.Investors Interest.Rate
5                       6000        15.31%
6                      10000         7.90%

as you can see here the position is relative to current data , not the original one

Generally however we do not subset data by positions , we subset by either conditions or column names , if we are subsetting just on the basis of conditions or just column names we can directly pass those in square brackets

In [29]:
ld.head(2)

,ID,Amount.Requested,Amount.Funded.By.Investors,Interest.Rate,Loan.Length,Loan.Purpose,Debt.To.Income.Ratio,State,Home.Ownership,Monthly.Income,FICO.Range,Open.CREDIT.Lines,Revolving.CREDIT.Balance,Inquiries.in.the.Last.6.Months,Employment.Length
0,81174.0,20000,20000,8.90%,36 months,debt_consolidation,14.90%,SC,MORTGAGE,6541.67,735-739,14,14272,2.0,< 1 year
1,99592.0,19200,19200,12.12%,36 months,debt_consolidation,28.36%,TX,MORTGAGE,4583.33,715-719,12,11140,1.0,2 years

In [39]:
ld["Home.Ownership"].unique()

array(['MORTGAGE', 'RENT', 'OWN', 'OTHER', 'NONE', nan], dtype=object)

In [48]:
condition = (ld['Home.Ownership']=='MORTGAGE') & (ld['Monthly.Income']>5000)

In [49]:
ld[condition].head(3)

,ID,Amount.Requested,Amount.Funded.By.Investors,Interest.Rate,Loan.Length,Loan.Purpose,Debt.To.Income.Ratio,State,Home.Ownership,Monthly.Income,FICO.Range,Open.CREDIT.Lines,Revolving.CREDIT.Balance,Inquiries.in.the.Last.6.Months,Employment.Length
0,81174.0,20000,20000,8.90%,36 months,debt_consolidation,14.90%,SC,MORTGAGE,6541.67,735-739,14,14272,2.0,< 1 year
2,80059.0,35000,35000,21.98%,60 months,debt_consolidation,23.81%,CA,MORTGAGE,11500.00,690-694,14,21977,1.0,2 years
7,22090.0,33500,33450,17.14%,60 months,credit_card,14.70%,LA,MORTGAGE,13863.42,705-709,12,27874,0.0,10+ years

In [50]:
desired_cols = ['Home.Ownership','Monthly.Income']

In [54]:
result = ld.loc[condition,desired_cols]
result.shape

(686, 2)

in order to negate a condition or drop rows on the basis of a conditon , we just need to add a ~ symbol in front of the condition

In [57]:
ld[~(condition)].shape

(1814, 15)

In [58]:
1814+686

2500

in order to drop columns on the basis of names we can make use of the inbuilt drop function

In [68]:
len(ld.columns)

15

In [74]:
c = ld.drop(['Home.Ownership','Monthly.Income'],axis=1)

if you scroll through the output you will find that those columns are no more in the data, this however doesnt modify the original data , these columns are still present in the data

In [76]:
len(ld.columns)

13

In [71]:
len(c.columns)

13

In [79]:
#ld=ld.drop(['Home.Ownership','Monthly.Income'],axis=1)

In [80]:
len(ld.columns)

13

In [81]:
ld.drop(['Debt.To.Income.Ratio', 'State'],axis=1,inplace=True)

In [82]:
len(ld.columns)

11

this changes the data inplace

In [83]:
del ld['Employment.Length']

In [85]:
len(ld.columns)

10

## Numerical Analysis

To read from a csv file, we'll be using function read_csv. we can create a separate string first with complete path name and then use it in the function or anywhere else.

In [86]:
myfile='../data/bank-full.csv'
bd=pd.read_csv(myfile,sep=";")

In [88]:
bd.shape

(45211, 17)

In [89]:
bd.head(10)

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no
5,35,management,married,tertiary,no,231,yes,no,unknown,5,may,139,1,-1,0,unknown,no
6,28,management,single,tertiary,no,447,yes,yes,unknown,5,may,217,1,-1,0,unknown,no
7,42,entrepreneur,divorced,tertiary,yes,2,yes,no,unknown,5,may,380,1,-1,0,unknown,no
8,58,retired,married,primary,no,121,yes,no,unknown,5,may,50,1,-1,0,unknown,no
9,43,technician,single,secondary,no,593,yes,no,unknown,5,may,55,1,-1,0,unknown,no

In [90]:
bd.columns

Index(['age', 'job', 'marital', 'education', 'default', 'balance', 'housing',
       'loan', 'contact', 'day', 'month', 'duration', 'campaign', 'pdays',
       'previous', 'poutcome', 'y'],
      dtype='object')

attribute dtype contains information regarding data type for all the columns

In [91]:
bd.dtypes

age           int64
job          object
marital      object
education    object
default      object
balance       int64
housing      object
loan         object
contact      object
day           int64
month        object
duration      int64
campaign      int64
pdays         int64
previous      int64
poutcome     object
y            object
dtype: object

dtype object refers to categorical variables for columns. You can check dtype for individual columns as follows :

In [97]:
#bd["month"].dtype

Function describe quickly prepares summary for numeric columns in the data.

In [96]:
#bd.describe()

In [95]:
bd.nunique()

age            77
job            12
marital         3
education       4
default         2
balance      7168
housing         2
loan            2
contact         3
day            31
month          12
duration     1573
campaign       48
pdays         559
previous       41
poutcome        4
y               2
dtype: int64

In [100]:
bd["marital"].unique()

array(['married', 'single', 'divorced'], dtype=object)

you can access specific summary statstic as well using respective functions. For example to find median of all numeric columns you do this :

In [103]:
bd.median()

age          39.0
balance     448.0
day          16.0
duration    180.0
campaign      2.0
pdays        -1.0
previous      0.0
dtype: float64

these describe and individual summary functions can be used with individual columns or subset of data too.

In [104]:
bd["age"].describe()

count    45211.000000
mean        40.936210
std         10.618762
min         18.000000
25%         33.000000
50%         39.000000
75%         48.000000
max         95.000000
Name: age, dtype: float64

In [105]:
bd[["age","previous"]].describe()

                age      previous
count  45211.000000  45211.000000
mean      40.936210      0.580323
std       10.618762      2.303441
min       18.000000      0.000000
25%       33.000000      0.000000
50%       39.000000      0.000000
75%       48.000000      0.000000
max       95.000000    275.000000

The need for custom functions is minimal unless you have very specific requirements. The full range of basic statistics that are quickly calculable and built into the base Pandas package are:

|Function	|Description|
|-----------|-----------|
|count	|Number of non-null observations|
|sum	|Sum of values|
|mean	|Mean of values|
|mad	|Mean absolute deviation|
|median	|Arithmetic median of values|
|min	|Minimum|
|max	|Maximum|
|mode	|Mode|
|abs	|Absolute Value|
|prod	|Product of values|
|std	|Unbiased standard deviation|
|var	|Unbiased variance|
|sem	|Unbiased standard error of the mean|
|skew	|Unbiased skewness (3rd moment)|
|kurt	|Unbiased kurtosis (4th moment)|
|quantile	|Sample quantile (value at %)|
|cumsum	|Cumulative sum|
|cumprod	|Cumulative product|
|cummax	|Cumulative maximum|
|cummin	|Cumulative minimum|

For categorical variables, these kind of numeric summaries can not be calculated. As a summary we need to look at frequency of levels/categories of categorical variable. Which can be achieved through function value_counts(). This function doesn't work with a data frame.

In [110]:
bd["job"].unique()

array(['management', 'technician', 'entrepreneur', 'blue-collar',
       'unknown', 'retired', 'admin.', 'services', 'self-employed',
       'unemployed', 'housemaid', 'student'], dtype=object)

In [106]:
bd["job"].value_counts()
## value_counts : does it count missing values

blue-collar      9732
management       9458
technician       7597
admin.           5171
services         4154
retired          2264
self-employed    1579
entrepreneur     1487
unemployed       1303
housemaid        1240
student           938
unknown           288
Name: job, dtype: int64

In [111]:
k = bd["job"].value_counts()
k

blue-collar      9732
management       9458
technician       7597
admin.           5171
services         4154
retired          2264
self-employed    1579
entrepreneur     1487
unemployed       1303
housemaid        1240
student           938
unknown           288
Name: job, dtype: int64

In [114]:
k.values

array([9732, 9458, 7597, 5171, 4154, 2264, 1579, 1487, 1303, 1240,  938,
        288])

In [116]:
k.iloc[2:5]

technician    7597
admin.        5171
services      4154
Name: job, dtype: int64

In [117]:
k.loc["services"]

4154

In [119]:
k.iloc[4]

4154

You can use function select_dtypes for extracting a specific type of data columns from a dataframe as subset

In [120]:
len(bd.columns)

17

In [121]:
bd_cat_data=bd.select_dtypes(['object'])

In [122]:
len(bd_cat_data.columns)

10

attribute columns contains all column names of a data.frame

In [124]:
bd_cat_data.dtypes

job          object
marital      object
education    object
default      object
housing      object
loan         object
contact      object
month        object
poutcome     object
y            object
dtype: object

In [128]:
for c in bd_cat_data.columns:
    print(c)
    print(15*"***")
    print(bd[c].value_counts())
    print(15*"***")

job
*********************************************
blue-collar      9732
management       9458
technician       7597
admin.           5171
services         4154
retired          2264
self-employed    1579
entrepreneur     1487
unemployed       1303
housemaid        1240
student           938
unknown           288
Name: job, dtype: int64
*********************************************
marital
*********************************************
married     27214
single      12790
divorced     5207
Name: marital, dtype: int64
*********************************************
education
*********************************************
secondary    23202
tertiary     13301
primary       6851
unknown       1857
Name: education, dtype: int64
*********************************************
default
*********************************************
no     44396
yes      815
Name: default, dtype: int64
*********************************************
housing
*********************************************
yes    25130
no     20081
Name: housing, dtype: int64
*********************************************
loan
*********************************************
no     37967
yes     7244
Name: loan, dtype: int64
*********************************************
contact
*********************************************
cellular     29285
unknown      13020
telephone     2906
Name: contact, dtype: int64
*********************************************
month
*********************************************
may    13766
jul     6895
aug     6247
jun     5341
nov     3970
apr     2932
feb     2649
jan     1403
oct      738
sep      579
mar      477
dec      214
Name: month, dtype: int64
*********************************************
poutcome
*********************************************
unknown    36959
failure     4901
other       1840
success     1511
Name: poutcome, dtype: int64
*********************************************
y
*********************************************
no     39922
yes     5289
Name: y, dtype: int64
*********************************************

In [129]:
for c in bd_cat_data.columns:
    print(c,":",bd[c].nunique())

job : 12
marital : 3
education : 4
default : 2
housing : 2
loan : 2
contact : 3
month : 12
poutcome : 4
y : 2

For cross frequency tables between two variables we can use function cross tab as follows

In [141]:
pd.crosstab(bd["default"],bd["job"])

job,admin.,blue-collar,entrepreneur,housemaid,management,retired,self-employed,services,student,technician,unemployed,unknown
default,,,,,,,,,,,,
no,5097,9531,1432,1218,9294,2238,1546,4079,935,7467,1273,286
yes,74,201,55,22,164,26,33,75,3,130,30,2

In [131]:
pd.crosstab(bd["y"],bd["job"],margins=True)

job,admin.,blue-collar,entrepreneur,housemaid,management,retired,self-employed,services,student,technician,unemployed,unknown,All
y,,,,,,,,,,,,,
no,4540,9024,1364,1131,8157,1748,1392,3785,669,6757,1101,254,39922
yes,631,708,123,109,1301,516,187,369,269,840,202,34,5289
All,5171,9732,1487,1240,9458,2264,1579,4154,938,7597,1303,288,45211

you can make higher dimension crosstab as well with the same function. To look at summary of a numerical variable across category of some categorical variable . we can use groupby functionality for the same lets look at examples to understand this:

In [132]:
bd["age"].mean()

40.93621021432837

In [134]:
desired_cols = ["job","age"]
bd[desired_cols].head(5)

            job  age
0    management   58
1    technician   44
2  entrepreneur   33
3   blue-collar   47
4       unknown   33

In [137]:
bd.groupby('job')["age"].mean()

job
admin.           39.289886
blue-collar      40.044081
entrepreneur     42.190989
housemaid        46.415323
management       40.449567
retired          61.626767
self-employed    40.484484
services         38.740250
student          26.542644
technician       39.314598
unemployed       40.961627
unknown          47.593750
Name: age, dtype: float64

this gives us average age across different job categories . You can use any other statistical summary function given in the table discussed previously in this module

you can calculate multiple groupwise summary stats for different columns also. Lets look at example below:

In [138]:
bd.groupby(['housing','loan'])["age","balance"].mean()

                    age      balance
housing loan
no      no    43.260695  1737.606719
        yes   42.417449   752.713243
yes     no    39.142947  1256.407793
        yes   39.329059   788.537898

you can use function agg with grouped data to calculate different summary stats for different columns. Here is an example

In [139]:
bd.groupby(['housing','loan']).agg({'age':'mean','duration':'max','balance':'sum'})

                    age  duration   balance
housing loan
no      no    43.260695      3881  29893786
        yes   42.417449      3422   2165556
yes     no    39.142947      4918  26086795
        yes   39.329059      3253   3443545

## Visual Data Analysis

Next we look at ways to visually summarise our data. Simple plot function for numeric columns, plots values along the observation numbers

In [ ]:
bd["balance"].plot()

In [ ]:
import seaborn as sns

In [ ]:
#density plot
sns.distplot(bd['age']) #histogram and density curve
# see what various values to these options do

In [ ]:
sns.distplot(bd['age'],kde=False,bins=10,hist=True)

In [ ]:
myplot=sns.distplot(bd['age'],kde=False,norm_hist=True,bins=10,hist=True)
myimg=myplot.get_figure()

In [ ]:
myimg.savefig('output.png')

In [ ]:
#sns.kdeplot(bd['pdays'],shade=True)
sns.kdeplot(bd['age'],shade=True)

In [ ]:
sns.boxplot(bd['age'])

## numeric-numeric

In [ ]:
sns.jointplot(x="age", y="balance", data=bd)

In [ ]:
sns.jointplot(x="age", y="balance", data=bd.iloc[:100,:],
              kind="hex",size=10,color="g")

In [ ]:
#linear model plot
sns.lmplot(x='duration', y='campaign', 
           data=bd.iloc[1:500,:],
          hue="housing",
          col="default",
          row="loan")

## Categorical

In [ ]:
sns.countplot(x="education", data=bd)

# Heatmaps

In [ ]:
sns.heatmap(bd.corr())

## Modifying Data

In [ ]:
cities=["Delhi","Mumbai","Kolkata","Chennai"]
code = ["11","22","33","4a"]

mydata=list(zip(cities,code))
df = pd.DataFrame(data=mydata,columns=["cities","codes"])

df

In [ ]:
df.dtypes

you can see here that variable code is of type categorical, because we supplied the numbers in quotes. All the values in that column are essentially numbers except "4a". We can force numeric type on that column and values which can be converted to numbers will be converted. and values like "4a" which can not be converted to numbers will be converted NaN instead.

In [ ]:
# df["codes"]
df["codes"]=pd.to_numeric(df["codes"],errors="coerce")
# df.dtypes

In [ ]:
df

For creating a new column in the data , you can always create a list which can be attached to the data as couple of examples given below:

In [ ]:
# modifying an existing column
df["cities2"]=[x.replace("a","6") for x in df["cities"]]
df

In [ ]:
# adding a new column using existing ones
df["code_log"]=[math.log(x) for x in df["codes"]]
df

In [ ]:
# you can use multiple columns too
df["new"]=df.codes+df.code_log
df["new2"]=df.new+2
df

In [ ]:
# conditional variables
df = pd.DataFrame({'Type':list('ABBC'), 'Set':list('ZZXY')})
df

In [ ]:
df['color'] = np.where(df['Set']=='Z', 'green', 'red')
df

in function np.where, first argument is the condition which may or may not involve existing columns of the data, second arugument is the value which the new column will take when the condition in first argument is true . If the condition is not true , new column will take value from the third argument.

In [ ]:
df['abc'] = np.where(df['Set']=='Z', df['Type'], df['Set'])
df

As you can see , second and third arguments of the function np.where dont need to be constant values. They can be similar length lists as well coming from a dataframe or otherwise.

To drop columns you can either use their name or positions . Here are few examples:

In [ ]:
df

In [ ]:
df=df.drop("abc",axis=1) 

# to drop inplace , you can use option inplace as we see in the next exmaple

In [ ]:
df

In [ ]:
df.drop("color",axis=1,inplace=True)

In [ ]:
df

In [ ]:
df.columns[0]

In [ ]:
df=df.drop(df.columns[0],axis=1)

In [ ]:
df

Notice that while using column positions , counting starts from 0.

Next we see how to drop observations from a data using both , row positions and conditions

In [ ]:
df=df.drop([3],axis=0)

In [ ]:
df

You can see that 4th row from the data has been deleted. Remebered that here also counting start at 0.Next we see subsetting data based a condition.

In [ ]:
df=df[df["Type"]=="B"]

In [ ]:
df

So for we have seen, how to select entire columns and process them. Many at times you might need to select entire rows or specific values in the columns. Here is how you do it.

In [ ]:
df.index

Notice that the index is still from the original data, you can either update that or use the existing values.We'll update the index here.

In [ ]:
df['col2']=[3,4]
df.reset_index(drop=True)

In [ ]:
# selecting a row
df.iloc[0]

In [ ]:
# selecting a sprecific value with row,column names/indices
print(df.iloc[0,1])
print(df.iloc[0]['Type'])

This will come in handy when you want to access position wise data in a for loop.

### Merge & Concatenate
In this section we see how to combine two or more dataframes in various ways. Starting with simple vertical stacking:

In [ ]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                       'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']}
                        )

In [ ]:
df2 = pd.DataFrame({'A': ['A4', 'A1', 'A2', 'A3'],
                       'B': ['B4', 'B1', 'B2', 'B3'],
                        'C': ['C4', 'C1', 'C2', 'C3'],
                        'D': ['D4', 'D1', 'D2', 'D3']}
                        )

In [ ]:
df1

In [ ]:
df2

For simple stacking [vertical or horizontal], we'll be using function concat. By using axis option, you can either horizontally or vertically stack the data. Keep in mind that pandas data.frames can have duplicate column names, which can a be huge hassle later on. So when you are horizontally stacking two datasets, do check for that possibility.

In [ ]:
#vertical stacking
newdata_long=pd.concat([df1,df2],axis=0)

In [ ]:
newdata_long

In [ ]:
#reset index
newdata_long.reset_index(drop=True)
newdata_long

In [ ]:
df3 = pd.DataFrame({'E': ['A4', 'A1', 'A2', 'A3',"ab"],
                       'F': ['B4', 'B1', 'B2', 'B3',"ab"],
                        'G': ['C4', 'C1', 'C2', 'C3',"ab"],
                        'H': ['D4', 'D1', 'D2', 'D3',"ab"]}
                        )
df3

In [ ]:
newdata_wide=pd.concat([df1,df3],axis=1)
newdata_wide

Simple vertical and horizontal stacking at times doesnt work. You need to merge data by some keys . lets look how to do inner,outer,left,right joins using the function merge.

In [ ]:
df1=pd.DataFrame({"custid":[1,2,3,4,5],
                 "product":["Radio","Radio","Fridge","Fridge","Phone"]})
df2=pd.DataFrame({"custid":[3,4,5,6,7],
                 "state":["UP","UP","UP","MH","MH"]})

In [ ]:
df1

In [ ]:
df2

In [ ]:
# inner join
inner=pd.merge(df1,df2,on=["custid"])
inner

In [ ]:
#outer join
outer=pd.merge(df1,df2,on=["custid"],how='outer')
outer

In [ ]:
#left join
left=pd.merge(df1,df2,on=["custid"],how='left')
left

In [ ]:
#right join
right=pd.merge(df1,df2,on=["custid"],how='right')
right